const translationHEB = {
    "meetingsList": "רשימת המפגשים",
    "myMeetings": "המפגשים שלי",
    "whoWeAre": "מי אנחנו",
    "donate": "תרמו לנו",
    "contactUs": "צרו קשר",
    "text": "אנחנו האחים שלנו. ואנחנו כאן כדי לדבר חיים.<br />את 'האחים שלנו' הקמנו אנחנו, האחים השכולים,<br />כדי להמשיך ולדבר על החיים איתם. מהזווית שלנו.<br /><br />על הצחוקים, השטויות, הריבים, השיחות. כל מה שהיה בינינו ונגמר.<br />הקהילה שלנו עוצמתית, מכילה, מחבקת ושמחה.<br />אנחנו ממשיכים לחגוג את החיים, ולחיות לצד השכול.<br /><br />המטרה שלנו היא להזכיר ולזכור את האחים הפרטיים שלנו<br />ובאותה נשימה, ליצור תנועה ארצית ועולמית של זיכרון והנצחה.<br />",


    "approve": "אישור",
    "cancel": "ביטול",


    'sunday': 'יום ראשון, ב באייר, 26.04',
    'monday': 'יום שני, ג באייר, 27.04',
    'tuesday': 'יום שלישי, ד באייר, 28.04',
    'wednesday': 'יום רביעי, ה באייר, 29.04',

}

export default translationHEB;